Repository: ZakariaOualmam/Mzra3ti
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: My Farm
ar: مزرعتي

# splashWelcome
source: Welcome — My Farm
ar: مرحبا — مزرعتي

# splashSlogan
source: Manage your farm easily
ar: دبّر مزرعتك بسهولة

source: Irrigation
ar: السقي

source: Expenses
ar: المصاريف

# report
source: Profit & Loss
ar: الربح و الخسارة

# irrigationShort
source: Water
ar: سقي

# expensesShort
source: Money
ar: فلوس

# profitShort
source: Profit
ar: ربح

# lossShort
source: Loss
ar: خسارة

# farmsShort
source: Farms
ar: مزارع

# weatherShort
source: Weather
ar: الطقس

# addShort
source: Add
ar: زيد

# reportsShort
source: Reports
ar: تقرير

# settingsShort
source: Settings
ar: إعدادات

source: + Add Expense
ar: + زيد مصروف

# expenseCategory
source: Expense Type
ar: نوع المصروف

source: Amount
ar: المبلغ

# noExpenses
source: No expenses recorded.
ar: ما كاين حتى مصروف مسجل.

# irrigationTitle
source: Irrigation Management
ar: تدبير السقي

source: + Add Irrigation
ar: + زيد سقي

# irrigationNote
source: Note (optional)
ar: ملاحظة (اختياري)

source: Remind Me
ar: فكرني

source: No irrigations
ar: لا توجد عمليات سقي

# harvestTitle
source: Harvest Management
ar: تدبير الحصاد

source: + Add Harvest
ar: + زيد حصاد

source: Quantity
ar: الكمية

# pricePerUnit
source: Price (DH)
ar: السعر (DH)

# harvestSummaryTitle
source: Harvest Summary
ar: خلاصة الحصاد

# totalQty
source: Total
ar: المجموع

# totalRevenue
source: Revenue
ar: المداخيل

source: Profit
ar: الربح

# totalExpenses
source: Expenses
ar: المصاريف

source: No harvests
ar: لا توجد عمليات حصاد

# journalTitle
source: Farm Journal
ar: دفتر الفلاحة

# addJournal
source: + Add Note
ar: + زيد ملاحظة

source: Activity
ar: شنو دار

# attachPhoto
source: Attach Photo (optional)
ar: زيد صورة (اختياري)

source: No journal entries.
ar: ما كاين حتى ملاحظة.

# reportsTitle
source: Reports
ar: التقارير

source: Export PDF
ar: حفظ PDF

# shareWhatsapp
source: Share on WhatsApp
ar: صيفط ف واتساب

source: Monthly Summary
ar: خلاصة الشهر

# dashboardTitle
source: Home
ar: الرئيسية

# dashboardSubtitle
source: Quick Overview
ar: نظرة سريعة

source: Farms
ar: المزارع

source: Weather
ar: الطقس

# weatherTitle
source: Weather
ar: الطقس

source: Irrigation Advice
ar: نصيحة للسقي

# settingsTitle
source: Settings
ar: الإعدادات

# offlineMode
source: Offline
ar: بلا نت

# accessibilityTitle
source: Accessibility
ar: سهولة الاستعمال

source: Large Text
ar: كتابة كبيرة

source: High Contrast
ar: ألوان واضحة

source: Voice Feedback
ar: الصوت

source: Save Settings
ar: حفظ الإعدادات

# addFarmTitle
source: Add Farm
ar: زيد مزرعة

source: Farm Name
ar: اسم المزرعة

# farmLocation
source: Location
ar: المكان

source: Crop Type
ar: نوع المحصول

source: Area
ar: المساحة

source: Notes
ar: ملاحظات

source: Save
ar: حفظ

# loginTitle
source: Welcome to My Farm
ar: مرحبا في مزرعتي

# loginSubtitle
source: Choose how to start
ar: اختار كيفاش بغيتي تبدا

source: Start without account
ar: ابدا بلا حساب

# loginOrRegister
source: Login / Register
ar: دخول / تسجيل

# continueText
source: Continue
ar: تفضل

source: My Account
ar: حسابي

source: Profile
ar: الملف الشخصي

source: Data Sync
ar: المزامنة

source: Preferences
ar: التفضيلات

source: Dark Mode
ar: الوضع الليلي

# darkModeOn
source: Dark theme active
ar: الوضع الليلي مفعل

# darkModeOff
source: Light theme active
ar: الوضع النهاري مفعل

source: Appearance
ar: المظهر

source: Language
ar: اللغة

source: Notifications
ar: الإشعارات

source: Support
ar: الدعم

source: Help
ar: المساعدة

source: Feedback
ar: ملاحظاتك

source: About App
ar: عن التطبيق

source: Logout
ar: تسجيل الخروج

source: Select Language
ar: اختار اللغة

# newIrrigationNotification
source: Time to irrigate!
ar: وقت السقي!

# irrigationNotificationDesc
source: North farm needs watering today
ar: المزرعة الشمالية محتاجة السقي اليوم

# newExpenseNotification
source: New expense recorded
ar: مصروف جديد مسجل

# expenseNotificationDesc
source: 450 MAD recorded for fertilizers
ar: تسجلت 450 درهم للأسمدة

# newHarvestNotification
source: Harvest time coming!
ar: وقت الحصاد قرب!

# harvestNotificationDesc
source: Tomatoes will be ready this week
ar: الطماطم غادي يكونو جاهزين هاد الأسبوع

# deleteNotification
source: Delete
ar: امسح

source: No notifications
ar: ما كاين حتى إشعار

# notificationsTitle
source: Notifications
ar: الإشعارات

# onboardingIrrigationTitle
source: Water Irrigation
ar: سقي الماء

# onboardingIrrigationText
source: Record irrigation time and amount easily
ar: سجل وقت و كمية السقي بسهولة

# onboardingExpensesTitle
source: Expenses
ar: المصاريف

# onboardingExpensesText
source: Record every expense to track your spending
ar: سجل كل مصروف باش تعرف شحال تنصرف

# onboardingProfitTitle
source: Profit & Loss
ar: الربح و الخسارة

# onboardingProfitText
source: View your profit and loss in a simple report
ar: شوف الربح و الخسارة ديالك في تقرير بسيط

# expensesLabel
source: Expenses
ar: المصاريف

# totalRevenueLong
source: Total Revenue
ar: المجموع ديال الفلوس

# profitLabel
source: Profit
ar: الربح

# irrigationsCount
source: Irrigations
ar: السقيات

# irrigationsCountMonth
source: Irrigations this month
ar: سقيات هاد الشهر

# farmSavedSuccess
source: Farm saved
ar: المزرعة تسجلات

# fieldRequired
source: This field is required
ar: هاد الحقل ضروري

# selectOption
source: Select
ar: اختار

source: Wheat
ar: قمح

source: Corn
ar: دورة

source: Vegetables
ar: خضروات

source: Olives
ar: زيتون

source: Skip
ar: تفوت

source: Next
ar: مبعد

source: Start
ar: بدا

# noAccountHelperText
source: Don't have an account? You can start without registering
ar: ما عندكش حساب؟ تقدر تبدا بلا ما تسجل

# backTooltip
source: Back
ar: رجوع

# notificationsTooltip
source: Notifications
ar: الإشعارات

# menuTooltip
source: Menu
ar: القائمة

# forecastTitle
source: Forecast - 7 days
ar: التوقعات - 7 أيام

# timeLabel
source: Time
ar: وقت

# reminderPrefix
source: Reminder:
ar: تذكير:

source: Clear reminder
ar: امسح التذكير

source: Snooze reminder
ar: أجل التذكير

source: Delete irrigation
ar: حذف السقي

source: Total
ar: المجموع

# numberShort
source: No.
ar: رقم

source: Crop
ar: الزرع

# qtyShort
source: Qty
ar: الكمية

source: Price
ar: السعر

source: Revenue
ar: الإيرادات

source: Date
ar: التاريخ

source: Category
ar: النوع

source: PDF export failed
ar: فشل تصدير PDF

# helpContact
source: For help, contact us: support@mzra3ti.ma
ar: للمساعدة، اتصل بنا: support@mzra3ti.ma

# appNameAlt
source: My Farm
ar: مزرعتي

# okButton
source: OK
ar: حسناً

# feedbackThanks
source: Thank you! Send your feedback to: feedback@mzra3ti.ma
ar: شكراً لك! أرسل ملاحظاتك إلى: feedback@mzra3ti.ma

# cancelButton
source: Cancel
ar: إلغاء

# largeTextSubtitle
source: Increase text size for easier reading
ar: زيد الكتابة باش تقرا ساهلة

# highContrastSubtitle
source: Use high contrast for better visibility
ar: تاخد كونتراست كبير للعيون

# voiceFeedbackSubtitle
source: Voice to help you hear changes
ar: صوت يسمح لك تسمع الحولات

# offlineModeSubtitle
source: Let app work without internet
ar: خلي التطبيق يخدم بلا نت

# operational
source: Data & Sync
ar: البيانات والمزامنة

source: Settings saved
ar: الإعدادات تسجلت

# aboutAppDescription
source: Mzra3ti App for Farm Management
ar: تطبيق مزرعتي لإدارة المزارع

# versionLabel
source: Version
ar: الإصدار

# copyrightText
source: © 2025 All Rights Reserved
ar: © 2025 جميع الحقوق محفوظة

source: Push Notifications
ar: الإشعارات الفورية

# pushNotificationsSubtitle
source: Receive alerts for important updates
ar: استقبل تنبيهات للأحداث المهمة

source: Irrigation Reminders
ar: تذكيرات السقي

# irrigationRemindersSubtitle
source: Get notified when irrigation is due
ar: تنبهك ملي يجي وقت السقي

source: Harvest Alerts
ar: تنبيهات الحصاد

# harvestAlertsSubtitle
source: Stay informed about harvest time
ar: خليك على اطلاع بوقت الحصاد

source: Sync Data
ar: مزامنة البيانات

# lastSynced
source: Last synced: Today at 10:30 AM
ar: آخر مزامنة: اليوم في 10:30 صباحاً

source: Profile Settings
ar: إعدادات الملف الشخصي

# profileSettingsSubtitle
source: Manage your personal information
ar: دبّر معلوماتك الشخصية

source: Privacy & Security
ar: الخصوصية والأمان

# privacySecuritySubtitle
source: Control your data and privacy
ar: تحكم في البيانات والخصوصية ديالك

# languageSubtitle
source: English
ar: العربية

source: Account
ar: الحساب

source: About
ar: عن التطبيق

# helpSubtitle
source: Get support and tutorials
ar: احصل على الدعم والدروس

# aboutAppSubtitle
source: Version 1.0.0
ar: الإصدار 1.0.0

# logoutTitle
source: Logout
ar: تسجيل الخروج

# logoutSubtitle
source: Sign out of your account
ar: اخرج من حسابك

# logoutConfirm
source: Are you sure you want to logout?
ar: واش متأكد بغيتي تخرج؟

# logoutButton
source: Logout
ar: خروج

source: Email
ar: البريد الإلكتروني

# phone
source: Phone Number
ar: رقم الهاتف

source: Email or Phone
ar: البريد أو الهاتف

source: Password
ar: كلمة السر

source: Confirm Password
ar: تأكيد كلمة السر

source: Full Name
ar: الاسم الكامل

# loginButton
source: Login
ar: دخول

# registerButton
source: Register
ar: تسجيل

source: Forgot Password?
ar: نسيتي كلمة السر؟

# alreadyHaveAccount
source: Already have an account?
ar: عندك حساب؟

# dontHaveAccount
source: Don't have an account?
ar: ما عندكش حساب؟

source: Sign Up
ar: سجل

source: Sign In
ar: دخل

# emailRequired
source: Email is required
ar: البريد ضروري

# emailInvalid
source: Please enter a valid email
ar: البريح مشي صالح

# phoneInvalid
source: Please enter a valid phone number
ar: الرقم خاطئ

# passwordRequired
source: Password is required
ar: كلمة السر ضرورية

# passwordTooShort
source: Password must be at least 6 characters
ar: كلمة السر يجب أن تكون 6 أحرف على الأقل

source: Passwords don't match
ar: كلمات السر مشي متطابقة

# nameRequired
source: Name is required
ar: الاسم ضروري

# registrationSuccess
source: Account created successfully!
ar: تم إنشاء الحساب بنجاح!

# loginSuccess
source: Welcome back!
ar: مرحبا بعودتك!

# loginError
source: Invalid credentials
ar: بيانات خاطئة

source: Welcome
ar: مرحبا

source: Create Account
ar: إنشاء حساب

# enterYourDetails
source: Enter your details to get started
ar: دخل بياناتك باش تبدا

source: Or continue with
ar: أو كمل بـ

source: Guest
ar: ضيف

# profileTitle
source: Profile
ar: الملف الشخصي

source: Edit Profile
ar: تعديل الملف الشخصي

source: Personal Information
ar: المعلومات الشخصية

source: Profile Picture
ar: صورة الملف الشخصي

source: Change Picture
ar: تغيير الصورة

source: Choose from Gallery
ar: اختر من المعرض

source: Take Photo
ar: التقط صورة

source: Remove Photo
ar: إزالة الصورة

source: Username
ar: اسم المستخدم

source: Edit Username
ar: تعديل اسم المستخدم

source: Enter new username
ar: أدخل اسم المستخدم الجديد

source: Phone Number
ar: رقم الهاتف

# editPhone
source: Edit Phone Number
ar: تعديل رقم الهاتف

source: Account Settings
ar: إعدادات الحساب

source: Change Password
ar: تغيير كلمة المرور

source: Delete Account
ar: حذف الحساب

# deleteAccountWarning
source: This action cannot be undone. All your data will be permanently deleted.
ar: لا يمكن التراجع عن هذا الإجراء. سيتم حذف جميع بياناتك نهائياً.

source: Cancel
ar: إلغاء

source: Delete
ar: حذف

source: Update
ar: تحديث

# updateSuccess
source: Updated successfully
ar: تم التحديث بنجاح

# updateError
source: Failed to update
ar: فشل التحديث

source: Back to Dashboard
ar: العودة إلى لوحة التحكم

source: Equipment Management
ar: إدارة المعدات

# equipmentSubtitle
source: Farm equipment and machinery
ar: معدات وآلات المزرعة

source: Crop Calendar
ar: التقويم الزراعي

# cropCalendarSubtitle
source: Planting and harvest schedules
ar: مواعيد الزراعة والحصاد

# notificationsMenu
source: Notifications
ar: التنبيهات

# notificationsSubtitle
source: Reminders and alerts
ar: التذكيرات والإشعارات

source: Analytics
ar: التحليلات

# analyticsSubtitle
source: Charts and statistics
ar: رسوم بيانية وإحصائيات

source: Sales
ar: المبيعات

# salesSubtitle
source: Track sales and customers
ar: تتبع المبيعات والعملاء

source: Home
ar: الرئيسية

source: Financial
ar: المالية

source: Settings
ar: إعدادات

source: Quick Actions
ar: أزرار سريعة

source: Calendar
ar: التقويم

source: Equipment
ar: المعدات

# notificationAlerts
source: Important reminders and alerts will appear here
ar: ستظهر هنا التذكيرات والتنبيهات المهمة

source: Add New Expense
ar: إضافة مصروف جديد

source: Edit Expense
ar: تعديل المصروف

source: Delete Expense
ar: حذف المصروف

# confirmDeleteExpense
source: Do you want to delete this expense?
ar: هل تريد حذف هذا المصروف؟

source: Add New Irrigation
ar: إضافة سقي جديد

source: Edit Irrigation
ar: تعديل السقي

# confirmDeleteIrrigation
source: Do you want to delete this operation?
ar: هل تريد حذف هذه العملية؟

source: Add New Harvest
ar: إضافة حصاد جديد

source: Edit Harvest
ar: تعديل الحصاد

source: Delete Harvest
ar: حذف الحصاد

# confirmDeleteHarvest
source: Are you sure you want to delete this harvest?
ar: هل أنت متأكد من حذف هذا الحصاد؟

source: Edit
ar: تعديل

source: Add New Equipment
ar: إضافة معدة جديدة

source: Edit Equipment
ar: تعديل المعدة

source: Delete Equipment
ar: حذف المعدة

# confirmDeleteEquipment
source: Do you want to delete this equipment?
ar: هل تريد حذف هذه المعدة؟

source: Add New Crop
ar: إضافة محصول جديد

source: Edit Crop
ar: تعديل المحصول

source: Delete Crop
ar: حذف المحصول

# confirmDeleteCrop
source: Do you want to remove this crop from calendar?
ar: هل تريد حذف هذا المحصول من التقويم؟

source: Add New Sale
ar: إضافة بيع جديد

source: Edit Sale
ar: تعديل البيع

source: Delete Sale
ar: حذف البيع

# confirmDeleteSale
source: Do you want to delete this sale?
ar: هل تريد حذف هذا البيع؟

source: Categories
ar: الفئات

source: Total Amount
ar: المبلغ الإجمالي

source: Expense Date
ar: تاريخ المصروف

# enterAmount
source: Enter expense amount
ar: أدخل قيمة المصروف

# noData
source: No data available
ar: لا توجد بيانات

source: No monthly data
ar: لا توجد بيانات شهرية

# noExpensesData
source: No expenses
ar: لا توجد مصاريف

# customerInfo
source: Customer Information
ar: معلومات العميل

source: Customer Name
ar: اسم العميل

# productInfo
source: Product Information
ar: معلومات المنتج

source: Product
ar: المنتج

# paymentAndStatus
source: Payment & Status
ar: الدفع والحالة

# dateLabel
source: Date
ar: التاريخ

source: No sales
ar: لا توجد مبيعات

# notesLabel
source: Notes
ar: ملاحظات

source: No equipment
ar: لا توجد معدات

source: No crops
ar: لا توجد محاصيل

# addCropsToTrack
source: Add your crops to track harvest dates
ar: أضف محاصيلك لتتبع مواعيد الحصاد

source: No ready crops
ar: لا توجد محاصيل جاهزة

# noNotificationsData
source: No notifications
ar: لا توجد تنبيهات

source: Quantity (kg)
ar: الكمية (كلغ)

# enterQuantityKg
source: Enter quantity in kilograms
ar: أدخل الكمية بالكيلوغرام

source: Price (DH/kg)
ar: السعر (درهم/كلغ)

# totalQuantityLabel
source: Total Quantity
ar: الكمية الإجمالية

# quantityLabel
source: Quantity
ar: الكمية

# priceLabel
source: Price
ar: السعر

source: Equipment Name
ar: اسم المعدة

source: Purchase Date
ar: تاريخ الشراء

source: Crop Name
ar: اسم المحصول

source: Season
ar: الموسم

source: Planting Date
ar: تاريخ الزراعة

source: Expected Harvest Date
ar: تاريخ الحصاد المتوقع

source: Enable Reminders
ar: تفعيل التذكيرات

source: Send reminder before harvest
ar: إرسال تذكير قبل موعد الحصاد

source: Pending
ar: معلق

source: Manager Name
ar: اسم المسؤول

source: Irrigation Date
ar: تاريخ السقي

source: Enable Reminder
ar: تفعيل التذكير

source: Send irrigation reminder
ar: إرسال تذكير لموعد السقي

source: Reminder
ar: تذكير

source: Harvest Date
ar: تاريخ الحصاد

# farmInfo
source: Name/Area/Location/Soil Type
ar: الاسم، المساحة، الموقع، نوع التربة

source: Farm Information
ar: معلومات المزرعة

source: Farm Data
ar: بيانات المزرعة

source: Land and Plots
ar: الأراضي والقطع

# divideFarmIntoPlots
source: Divide the farm into plots and manage them
ar: تقسيم المزرعة إلى قطع وإدارتها

source: Water Sources
ar: مصادر المياه

# wellsTanksIrrigation
source: Wells, Tanks, Irrigation Systems
ar: الآبار، الخزانات، أنظمة الري

# harvestManagement
source: Crops and Harvest Management
ar: إدارة المحاصيل والحصاد

source: Harvest Summary
ar: ملخص الحصاد

# harvestOperations
source: harvest operation
ar: عملية حصاد

source: Net Profit
ar: صافي الربح

source: Harvest Log
ar: سجل الحصاد

# clickToAddHarvest
source: Click + to add new harvest
ar: اضغط على + لإضافة حصاد جديد

# clickToAddExpense
source: Click + to add new expense
ar: اضغط على + لإضافة مصروف جديد

# clickToAddIrrigation
source: Click + to add new irrigation
ar: اضغط على + لإضافة سقي جديد

source: Popular Crops:
ar: محاصيل شائعة:

source: Customers
ar: العملاء

source: Cash
ar: نقدي

source: Paid
ar: مدفوع

source: Partially Paid
ar: مدفوع جزئياً

source: No customers
ar: لا يوجد عملاء

source: Ready for Harvest
ar: جاهز للحصاد

source: All Crops
ar: جميع المحاصيل

source: Grains
ar: حبوب

source: Fruits
ar: فواكه

source: Other
ar: أخرى

source: Spring
ar: الربيع

source: Summer
ar: الصيف

source: Autumn
ar: الخريف

source: Winter
ar: الشتاء

# daysCount
source: Days count (if needed)
ar: عدد الأيام (إذا لازم)

source: Average days to harvest
ar: متوسط الأيام حتى الحصاد

source: Irrigation Time
ar: وقت السقي

# additionalIrrigationInfo
source: Additional irrigation information
ar: معلومات إضافية عن السقي

# fullIrrigationTime
source: Full irrigation schedule
ar: موعد السقي الكامل

source: Tractor
ar: جرار

# purchasePrice
source: Purchase Price (DH)
ar: سعر الشراء (DH)

source: Active
ar: نشط

source: Maintenance
ar: صيانة

source: In Maintenance
ar: قيد الصيانة

source: Needs Maintenance
ar: تحتاج صيانة

source: Dates
ar: التواريخ

source: Last Maintenance
ar: آخر صيانة

source: Not done yet
ar: لم تتم بعد

source: Next Maintenance
ar: الصيانة القادمة

source: Not specified
ar: غير محددة

source: Expected Revenue
ar: الإيرادات المتوقعة

source: Upcoming maintenance
ar: صيانة قادمة

# categoryFarming
source: Farming
ar: زراعة

# categoryTractor
source: Tractor
ar: تراكتور

# categoryIrrigation
source: Irrigation
ar: سقي

# categoryLabor
source: Labor
ar: عمال

# categoryAccessories
source: Accessories
ar: ملحقات

# categoryOther
source: Other
ar: أخرى

# equipmentTractor
source: Tractor
ar: جرار

# equipmentWaterPump
source: Water Pump
ar: مضخة ماء

# equipmentHandTools
source: Hand Tools
ar: أدوات يدوية

# equipmentFarmMachinery
source: Farm Machinery
ar: آلات زراعية

# equipmentIrrigationSystem
source: Irrigation System
ar: نظام ري

# equipmentOther
source: Other
ar: أخرى

# cropWheat
source: Wheat
ar: قمح

# cropPotatoes
source: Potatoes
ar: بطاطس

# cropCucumber
source: Cucumber
ar: خيار

# cropTomatoes
source: Tomatoes
ar: طماطم

# cropOnion
source: Onion
ar: بصل

# cropCarrot
source: Carrot
ar: جزر

# cropPepper
source: Pepper
ar: فلفل

# cropWatermelon
source: Watermelon
ar: بطيخ

# cropStrawberry
source: Strawberry
ar: فراولة

# cropCorn
source: Corn
ar: ذرة

# totalExpensesTitle
source: Total Expenses
ar: إجمالي المصاريف

# totalQuantityKg
source: kg
ar: كلغ

source: Daily Average
ar: متوسط يومي

source: Last 7 Days
ar: آخر 7 أيام

# monthSummary
source: Summary
ar: ملخص 6 أشهر

# daySaturday
source: Saturday
ar: السبت

# dayFriday
source: Friday
ar: الجمعة

# dayThursday
source: Thursday
ar: الخميس

# dayWednesday
source: Wednesday
ar: الأربعاء

# dayTuesday
source: Tuesday
ar: الثلاثاء

# dayMonday
source: Monday
ar: الإثنين

# daySunday
source: Sunday
ar: الأحد

# totalProfitTitle
source: Total Profit
ar: إجمالي الأرباح

source: Expense Breakdown
ar: توزيع المصاريف

# expensesChart
source: Expenses
ar: المصاريف

source: Broken
ar: معطل

# purchasedOn
source: Purchased
ar: شراء
